cosmo-server/app/controllers/bought_tickets_controller.rb

     def index
        bought_tickets = BoughtTicket.all
---
SELECT "bought_tickets".* FROM "bought_tickets"

    def create
        bought_ticket = BoughtTicket.create(ticket_params)
---
INSERT INTO "bought_tickets" ("user_id", "banner", "name", "game", "ticket_price", "time_start", "time_end", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)