cosmo-server/app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
    def index
        event = Event.all

INSERT INTO "events" ("stadium_id", "name", "description", "game", "seats_required", "time_start", "time_end", "ticket_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        event = Event.create(event_params)

UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "updated description"], ["updated_at", "2022-08-30 23:05:59.736704"], ["id", 3]]
---
    def update
        event = event_find
        if  event
            event.update(event_params)

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 2]]
---
    def destroy
        event = event_find
        if event
            event.destroy

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def event_find
    event=  Event.find_by(id: params[:id])