cosmo-server/app/controllers/events_controller.rb

    def show
        event= Event.find_by(id: params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]