cosmo-server/app/controllers/images_controller.rb

SELECT "images".* FROM "images"
---
    def show_image
        render json: Image.all